# Load oh-my-zsh library
ohmyzsh/ohmyzsh path:lib

# Load bundles from oh-my-zsh
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/pipenv

# Load bundles from external repos
mattberther/zsh-pyenv
ytdl-org/youtube-dl
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
lukechilds/zsh-better-npm-completion

# Theme
geometry-zsh/geometry