alefragnani.project-manager
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
eamodio.gitlens
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
firefox-devtools.vscode-firefox-debug
hashicorp.terraform
idleberg.openvpn
jpoissonnier.vscode-styled-components
mikestead.dotenv
ms-azuretools.vscode-azureterraform
ms-azuretools.vscode-docker
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-account
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.vscode-typescript-next
ms-vscode.wordcount
octref.vetur
PKief.material-icon-theme
redhat.vscode-xml
rubbersheep.gi
ryanluker.vscode-coverage-gutters
znck.grammarly
